# EditProperties

## Description
Displays the 'Properties' dialog for all objects matching the specified search criteria

```pascal
PROCEDURE EditProperties(c : CRITERIA);
```

```python
def vs.EditProperties(c):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|Search criteria.|

## Remarks
Displays the Properties dialog for all objects matching the specified search criteria

## Examples
```pascal
EditProperties(c);
```
```python
import vs

# Displays the 'Properties' dialog for all objects matching the specified
# search criteria.
c = "(SEL=TRUE)"  # selection criteria - all selected objects

vs.EditProperties(c)
```

## Version
Availability: from VectorWorks12.5

## Category
* Criteria